# FaceNode Properties

---
The FaceNode type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from RenderNode)
| NodeName|  A readable name of the output node. (Inherited from RenderNode)
Top
#### Reference
FaceNode Class
Autodesk.Revit.DB Namespace